app/views/restaurants/show.html.erb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
---
<div class="row">
    <% restaurant = Restaurant.find(params[:restaurant_id]) %>