app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("restaurant_name", "restaurant_address", "restaurant_phone", "restaurant_website", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		# @user = current_user
		restaurant_params = params.require(:restaurant).permit(:restaurant_name, :restaurant_address, :restaurant_phone, :restaurant_website, :user_id)
		p restaurant_params
		@restaurant = Restaurant.create(restaurant_params)