app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "first_name", "last_name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		user_params = params.require(:user).permit(:username, :email, :first_name, :last_name, :password)
		@user = User.create(user_params)